In [37]:
import pandas as pd
import seaborn as sns
import numpy as np

In [11]:
tips = sns.load_dataset('tips')

In [13]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [19]:
# np.random.seed(42)
tips_10 = tips.sample(10,random_state=42)

In [25]:
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153         NaN  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198         NaN  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [23]:
tips_10.loc[np.random.permutation(tips_10.index)[:4],
        'total_bill'] = np.NaN

In [27]:
tips_10.groupby('sex').count()

/var/folders/hw/1ptsdfsn5gs38h0hr1hqwng80000gn/T/ipykernel_10490/3588281804.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tips_10.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [29]:
tips_10['total_bill'].fillna(tips_10['total_bill'].mean())

24     19.820000
6       8.770000
153    16.611667
211    16.611667
198    16.611667
176    16.611667
192    28.440000
124    12.480000
9      14.780000
101    15.380000
Name: total_bill, dtype: float64

In [31]:
print(tips['size'].value_counts())

size
2    156
3     38
4     37
5      5
1      4
6      4
Name: count, dtype: int64

In [33]:
tips.groupby('size').filter(lambda x: x['size'].count()>=30)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[231 rows x 7 columns]

In [39]:
np.nan

nan

In [41]:
from numpy import NaN,nan,NAN

In [43]:
nan

nan

In [45]:
NaN == NaN

False

In [49]:
pd.isnull(NaN)
pd.isnull(nan)
pd.isnull(NAN)

True

In [51]:
pd.notnull(np.nan)

False

In [53]:
pd.notnull('')

True

In [55]:
pd.isna(nan)

True

In [67]:
pd.read_csv('../data/survey_visited.csv',
            keep_default_na=False,
            na_values=['DR-1']).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ident   8 non-null      int64
 1   site    5 non-null      object
 2   dated   8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [65]:
pd.read_csv('../data/survey_visited.csv',na_values=[619]).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ident   7 non-null      float64
 1   site    8 non-null      object
 2   dated   7 non-null      object
dtypes: float64(1), object(2)
memory usage: 324.0+ bytes

In [69]:
data = pd.read_csv('../data/survey_visited.csv')

In [71]:
pd.to_datetime(data['dated'])

0   1927-02-08
1   1927-02-10
2   1939-01-07
3   1930-01-12
4   1930-02-26
5          NaT
6   1932-01-14
7   1932-03-22
Name: dated, dtype: datetime64[ns]

In [75]:
ebola = pd.read_csv('../data/country_timeseries.csv')

In [77]:
ebola.count()

Date                   122
Day                    122
Cases_Guinea            93
Cases_Liberia           83
Cases_SierraLeone       87
Cases_Nigeria           38
Cases_Senegal           25
Cases_UnitedStates      18
Cases_Spain             16
Cases_Mali              12
Deaths_Guinea           92
Deaths_Liberia          81
Deaths_SierraLeone      87
Deaths_Nigeria          38
Deaths_Senegal          22
Deaths_UnitedStates     18
Deaths_Spain            16
Deaths_Mali             12
dtype: int64

In [83]:
ebola.isnull().sum().sum()

1214